Tekla Open API Reference for Tekla Structures 2025
ImageItem.Name Property
 Gets or sets the image name.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ImageItem Class
Tekla.Structures.Dialog.UIControls Namespace